neekBruh/MUA_Control_SAMD51_Variant/MUA/variants/variant.h
/*
  @file varian.h
  Copyright (c) 2014-2015 Arduino LLC.  All right reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  Modified by Sebas Monje <2024-2025> to M.U.A. MISSION

  -> GuaraníSat2 -> MUA_Control -> FIUNA -> LME
*/

#ifndef _VARIANT_SAMD51_MICROMOD_
#define _VARIANT_SAMD51_MICROMOD_

// The definitions here needs a SAMD core >=1.6.10
#define ARDUINO_SAMD_VARIANT_COMPLIANCE 10610

//----------------------------------------------------------------------------
//        Definitions
//----------------------------------------------------------------------------

/** Frequency of the board main oscillator */
#define VARIANT_MAINOSC		(32768ul)

/** Master clock frequency */
#define VARIANT_MCK			  (120000000ul)

#define VARIANT_GCLK0_FREQ (120000000UL)
#define VARIANT_GCLK1_FREQ (48000000UL)
#define VARIANT_GCLK2_FREQ (100000000UL)

// #define PLACA_PRUEBAS
#define PLACA_FINAL
#define CORRECCION

//----------------------------------------------------------------------------
//        Headers
//----------------------------------------------------------------------------

#include "WVariant.h"

#ifdef __cplusplus
#include "SERCOM.h"
#include "Uart.h"
#endif // __cplusplus

#ifdef PLACA_PRUEBAS
#ifdef __cplusplus
extern "C"
{
#endif // __cplusplus

//----------------------------------------------------------------------------
//        Pins
//----------------------------------------------------------------------------

// Number of pins defined in PinDescription array
#define PINS_COUNT           (54u)                // ERA 53...
#define NUM_DIGITAL_PINS     (16u)
#define NUM_ANALOG_INPUTS    (11u)
#define NUM_ANALOG_OUTPUTS   (1u)
#define analogInputToDigitalPin(p)  ((p < 6u) ? (p) + 14u : -1)

#define digitalPinToPort(P)        ( &(PORT->Group[g_APinDescription[P].ulPort]) )
#define digitalPinToBitMask(P)     ( 1 << g_APinDescription[P].ulPin )
//#define analogInPinToBit(P)        ( )
#define portOutputRegister(port)   ( &(port->OUT.reg) )
#define portInputRegister(port)    ( &(port->IN.reg) )
#define portModeRegister(port)     ( &(port->DIR.reg) )
#define digitalPinHasPWM(P)        ( g_APinDescription[P].ulPWMChannel != NOT_ON_PWM || g_APinDescription[P].ulTCChannel != NOT_ON_TIMER )

/*
 * digitalPinToTimer(..) is AVR-specific and is not defined for SAMD
 * architecture. If you need to check if a pin supports PWM you must
 * use digitalPinHasPWM(..).
 *
 * https://github.com/arduino/Arduino/issues/1833
 */
// #define digitalPinToTimer(P)

// General Purpose Pins
#define D0 0
#define D1 1
#define D2 2
#define D3 3
#define D4 4
#define D5 5
// #define D14 14      //Agregado

#define G0  2
#define G1  3
#define G2  4
#define G3  5
#define G4  6
#define G5  7
#define G6  8
#define G7  9
#define G8  10
#define G9  11
#define G11 29

#define PWM0 19
#define PWM1 20 

#define BATT_VIN 21 
#define POWER_CONTROL 12

#define CS 48 
#define CS1 52 
#define I2CINT 12

#define AUD_OUT 40
#define AUD_IN 41
#define AUD_BCLK 42
#define AUD_LRCLK 44
#define AUD_MCLK 43

// LEDs
//-------------------------------------------
#define PIN_LED_13           (13u)
#define PIN_LED              PIN_LED_13
#define LED_BUILTIN          PIN_LED_13
//-------------------------------------------

// Analog pins
//-------------------------------------------
#define PIN_A0               (17ul)
#define PIN_A1               (PIN_A0 + 1)
#define PIN_A2               (PIN_A0 + 2)
#define PIN_A3               (PIN_A0 + 4)
#define PIN_A4               (PIN_A0 + 5)
#define PIN_A5               (PIN_A0 + 6)
#define PIN_A6               (PIN_A0 + 7)
#define PIN_A7               (PIN_A0 + 8)
#define PIN_A8               (PIN_A0 + 9)
#define PIN_A9               (PIN_A0 + 10)
#define PIN_A10              (PIN_A0) 

//DAC
#define PIN_DAC0             PIN_A0

static const uint8_t A0   = PIN_A0;
static const uint8_t A1   = PIN_A1;
static const uint8_t A2   = PIN_A2;
static const uint8_t A3   = PIN_A3;
static const uint8_t A4   = PIN_A4;
static const uint8_t A5   = PIN_A5;
static const uint8_t A6   = PIN_A6;
static const uint8_t A7   = PIN_A7;
static const uint8_t A8   = PIN_A8;
static const uint8_t A9   = PIN_A9;
static const uint8_t A10  = PIN_A10;

static const uint8_t DAC0 = PIN_DAC0;

#define ADC_RESOLUTION		12
//-------------------------------------------

// Other pins
//-------------------------------------------
#define PIN_ATN              (53ul)
static const uint8_t ATN = PIN_ATN;
//-------------------------------------------

// Serial1 
//-------------------------------------------
#define PIN_SERIAL1_RX       (32ul)
#define PIN_SERIAL1_TX       (33ul)
#define PAD_SERIAL1_TX       (UART_TX_PAD_0)
#define PAD_SERIAL1_RX       (SERCOM_RX_PAD_1)
//-------------------------------------------

// SPI Interfaces
//-------------------------------------------
#define SPI_INTERFACES_COUNT 1 // CAMBIADO, son 2 al descomentar SPI1 ...
  
#define PIN_SPI_MOSI         (45u)
#define PIN_SPI_SCK          (46u)
#define PIN_SPI_MISO         (47u)
#define PIN_SPI_SS           (48u)
#define PERIPH_SPI           sercom0
#define PAD_SPI_TX           SPI_PAD_0_SCK_1 // Este valor indica que el pin transmitido (MOSI) está en el pad 0 y el pin de reloj (SCK) está en el pad 1
#define PAD_SPI_RX           SERCOM_RX_PAD_2

static const uint8_t SS	  = PIN_SPI_SS ;
static const uint8_t MOSI = PIN_SPI_MOSI ;
static const uint8_t MISO = PIN_SPI_MISO ;
static const uint8_t SCK  = PIN_SPI_SCK ;

// SPI1
// #define PIN_SPI1_MOSI         (49u)
// #define PIN_SPI1_SCK          (50u)
// #define PIN_SPI1_MISO         (51u)
// #define PIN_SPI1_SS           (52u)
// #define PERIPH_SPI1           sercom2
// #define PAD_SPI1_TX           SPI_PAD_0_SCK_1
// #define PAD_SPI1_RX           SERCOM_RX_PAD_2
//-------------------------------------------

// static const uint8_t SS1	 = PIN_SPI1_SS ; 	
// static const uint8_t MOSI1 = PIN_SPI1_MOSI ;
// static const uint8_t MISO1 = PIN_SPI1_MISO ;
// static const uint8_t SCK1  = PIN_SPI1_SCK ;

