neekBruh/MUA_Control_SAMD51_Variant/MUA/variants/variant.h
//-------------------------------------------
// QSPI FLASH                      //  AGREGADO/CAMBIADO
#define PIN_QSPI_D0          (49u)
#define PIN_QSPI_D1          (50u)
#define PIN_QSPI_D2          (51u)
#define PIN_QSPI_D3          (52u)

#define EXTERNAL_FLASH_DEVICE W25Q128JV_SM // Memoria FLASH externa de la placa de desarrollo MUA_Control
#define EXTERNAL_FLASH_USE_QSPI


// Wire Interfaces
//-------------------------------------------
#define WIRE_INTERFACES_COUNT 1

#define PIN_WIRE_SCL         (34u)
#define PIN_WIRE_SDA         (35u)
#define PERIPH_WIRE          sercom3
#define WIRE_IT_HANDLER      SERCOM3_Handler
#define WIRE_IT_HANDLER_0    SERCOM3_0_Handler
#define WIRE_IT_HANDLER_1    SERCOM3_1_Handler
#define WIRE_IT_HANDLER_2    SERCOM3_2_Handler
#define WIRE_IT_HANDLER_3    SERCOM3_3_Handler

static const uint8_t SDA = PIN_WIRE_SDA;
static const uint8_t SCL = PIN_WIRE_SCL;

// #define PIN_WIRE1_SCL         (36u)
// #define PIN_WIRE1_SDA         (37u)
// #define PERIPH_WIRE1          sercom4
// #define WIRE1_IT_HANDLER      SERCOM4_Handler
// #define WIRE1_IT_HANDLER_0    SERCOM4_0_Handler
// #define WIRE1_IT_HANDLER_1    SERCOM4_1_Handler
// #define WIRE1_IT_HANDLER_2    SERCOM4_2_Handler
// #define WIRE1_IT_HANDLER_3    SERCOM4_3_Handler

// static const uint8_t SDA1 = PIN_WIRE1_SDA;
// static const uint8_t SCL1 = PIN_WIRE1_SCL;
//----------------------------------------------

// Serial2
//---------------------------------------------- // AGREGADO
#define PIN_SERIAL2_TX       (36ul) // PA12
#define PIN_SERIAL2_RX       (37ul) // PA13
#define PAD_SERIAL2_TX       (UART_TX_PAD_0)
#define PAD_SERIAL2_RX       (SERCOM_RX_PAD_1)

// USB
//----------------------------------------------
#define PIN_USB_HOST_ENABLE (29ul)
#define PIN_USB_DM          (30ul)
#define PIN_USB_DP          (31ul)
//----------------------------------------------

// I2S Interfaces
#define PIN_I2S_FS           (44u)
//----------------------------------------------
#define I2S_INTERFACES_COUNT 1

#define I2S_DEVICE           0
#define I2S_CLOCK_GENERATOR  3

#define PIN_I2S_SDO          (40u)
#define PIN_I2S_SDI          (41u)
#define PIN_I2S_SCK          (42u)
#define PIN_I2S_MCK          (43u)
#define PIN_I2S_FS           (44u)
//----------------------------------------------


#if !defined(VARIANT_QSPI_BAUD_DEFAULT)
  #define VARIANT_QSPI_BAUD_DEFAULT 5000000
#endif

#ifdef __cplusplus
}
#endif

//----------------------------------------------------------------------------
//        Arduino objects - C++ only
//----------------------------------------------------------------------------

#ifdef __cplusplus

//	------------------------
//	 SERCOM DEFINITION
//	------------------------                               // Placa Final
extern SERCOM sercom0; // SPI                              // 
extern SERCOM sercom1; // I2S occupies lines               // SPI
extern SERCOM sercom2; // Serial2           // CAMBIADO    // I2C
extern SERCOM sercom3; // I2C                              // 
extern SERCOM sercom4; // I2C1 agregado // PB08 y PB09     // Serial1
extern SERCOM sercom5; // Serial1                          // Serial2 

extern Uart Serial1;
extern Uart Serial2;

#endif
/*
* These serial port names are intended to allow libraries and architecture-neutral
* sketches to automatically default to the correct port name for a particular type
* of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
* the first hardware serial port whose RX/TX pins are not dedicated to another use.
*
* SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
*
* SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
*
* SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
*
* SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
*
* SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
*                            pins are NOT connected to anything by default.
*/
#define SERIAL_PORT_USBVIRTUAL      Serial
#define SERIAL_PORT_MONITOR         Serial
// Serial has no physical pins broken out, so it's not listed as HARDWARE port

#define SERIAL_PORT_HARDWARE        Serial1
#define SERIAL_PORT_HARDWARE_OPEN   Serial1

#define SERIAL_PORT_HARDWARE2       Serial2
#define SERIAL_PORT_HARDWARE2_OPEN  Serial2

#endif

//////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////

#ifdef PLACA_FINAL
#ifdef __cplusplus
extern "C"
{
#endif // __cplusplus

//----------------------------------------------------------------------------
//        Pins
//----------------------------------------------------------------------------

// Number of pins defined in PinDescription array
#define PINS_COUNT           (49u)                
#define NUM_DIGITAL_PINS     (22u)
#define NUM_ANALOG_INPUTS    (3u)
#define NUM_ANALOG_OUTPUTS   (0u)
#define analogInputToDigitalPin(p)  ((p < 6u) ? (p) + 14u : -1)

#define digitalPinToPort(P)        ( &(PORT->Group[g_APinDescription[P].ulPort]) )
#define digitalPinToBitMask(P)     ( 1 << g_APinDescription[P].ulPin )
//#define analogInPinToBit(P)        ( )
#define portOutputRegister(port)   ( &(port->OUT.reg) )
#define portInputRegister(port)    ( &(port->IN.reg) )
#define portModeRegister(port)     ( &(port->DIR.reg) )
#define digitalPinHasPWM(P)        ( g_APinDescription[P].ulPWMChannel != NOT_ON_PWM || g_APinDescription[P].ulTCChannel != NOT_ON_TIMER )

/*
 * digitalPinToTimer(..) is AVR-specific and is not defined for SAMD
 * architecture. If you need to check if a pin supports PWM you must
 * use digitalPinHasPWM(..).
 *
 * https://github.com/arduino/Arduino/issues/1833
 */
// #define digitalPinToTimer(P)

